
/* these strings need to be localized */
"APP_TITLE"                 = "Blizzard Error";
"DEFAULT_MESSAGE"           = "The application encountered an unexpected error.";
"DEFAULT_PROMPT"            = "To help us identify the problem, please describe what you were doing when the error occurred.";
"CLOSE_BUTTON_NAME"         = "Close";
"CLOSE_BUTTON_TOOLTIP"      = "Close the error reporter window";
"REOPEN_BUTTON_NAME"        = "Reopen";
"REOPEN_BUTTON_TOOLTIP"     = "Restart the application";
"REPAIR_BUTTON_NAME"        = "Repair";
"REPAIR_BUTTON_TOOLTIP"     = "Run the Blizzard Repair tool to fix damaged or missing files";
"SEND_CHECKBOX_NAME"        = "Send to Blizzard";
"SEND_CHECKBOX_TOOLTIP"     = "Send information about this error to Blizzard to help improve this application";
"UUID_DESCRIPTION"          = "Please use the Report ID below when communicating with Blizzard about this issue.";
"SEND_FAILED_DIALOG_TITLE"  = "Failed to send";
"SEND_FAILED_DIALOG_TEXT"   = "Failed to post bug report.";
"OK_BUTTON_NAME"            = "OK";
"CANCEL_BUTTON_NAME"        = "Cancel";
"SEND_BUTTON_NAME"          = "Send";
"DONE_BUTTON_NAME"          = "Done";
"QUIT_BUTTON_NAME"          = "Quit";
"RETRY_BUTTON_NAME"         = "Retry";

/* these values are not required for localization since they are only used internally */
"REQUIRED"="Required";
"OPTIONAL"="Optional";
"DESCRIPTION"="Description";
"PRIMARY"="Primary";
"ACCOUNT"="Inspector Account";
"COMMENTS"="Comments";
"ATTACHED_FILES"="Attached Files";
"ADD_ASSIGNMENT"="Add Assignment";
"ASSIGNMENT"="Assignment";
"REMOVE_ASSIGNMENT"="Remove Assignment";
"MODULE"="Module";
"FEATURE"="Feature";
"PLATFORM"="Platform";
"STEPS"="Steps";
"ADDITIONAL_INFO"="Additional Info";
"SUMMARY"="Summary";
"REMOVE_ASSIGNMENT"="Remove Assignment";
"MILESTONE"="Milestone";
"PRIORITY"="Priority";
"REPRODUCIBILITY"="Reproducibility";
"QA_TEAM"="QA Team";
"SUMMARY_VALIDATION_FAILED"="Must enter a summary";
"ADD_ATTACHMENT"="Add Attachment";


/* general menu strings that need to be localized */

/* Top Level Items */
"MENU_APP" = "@{APP_TITLE}";
"MENU_EDIT" = "Edit";
"MENU_WINDOW" = "Window";

/* App Menu Items */
"MENU_APP_ABOUT" = "About @{APP_TITLE}";
"MENU_APP_SCREENSHOT" = "Screenshot";
"MENU_APP_HIDE" = "Hide @{APP_TITLE}";
"MENU_APP_HIDE_OTHERS" = "Hide Others";
"MENU_APP_SHOW_ALL" = "Show All";
"MENU_APP_QUIT" = "Quit @{APP_TITLE}";

/* Edit Menu Items */
"MENU_EDIT_UNDO" = "Undo";
"MENU_EDIT_CUT" = "Cut";
"MENU_EDIT_COPY" = "Copy";
"MENU_EDIT_PASTE" = "Paste";
"MENU_EDIT_DELETE" = "Delete";
"MENU_EDIT_SELECT_ALL" = "Select All";
"MENU_EDIT_FIND" = "Find";
"MENU_EDIT_FIND_FIND" = "Find…";
"MENU_EDIT_FIND_NEXT" = "Find Next";
"MENU_EDIT_FIND_PREVIOUS" = "Find Previous";
"MENU_EDIT_FIND_USE_SELECTION" = "Use Selection for Find";
"MENU_EDIT_FIND_JUMP_TO_SELECTION" = "Jump to Selection";
"MENU_EDIT_SPECIAL_CHARS" = "Special Characters…";

/* Window Menu Items */
"MENU_WINDOW_CLOSE" = "Close";
"MENU_WINDOW_MINIMIZE" = "Minimize";
"MENU_WINDOW_ZOOM" = "Zoom";
"MENU_WINDOW_FULLSCREEN" = "Toggle Full Screen";
"MENU_WINDOW_BRING_ALL_TO_FRONT" = "Bring All to Front";
